[
    {
        "id": "monty-hall",
        "title": "The Monty Hall Problem",
        "date": "Classic Game Theory",
        "description": "Picture this: you're on a game show with three doors. Behind one is a brand new car, behind the other two are goats. You pick door 1. The host then opens door 3—it's a goat! Now here's where it gets weird. He asks if you want to switch to door 2 or stick with your original choice. Most people think it doesn't matter. But here's the kicker: switching actually DOUBLES your odds from 33% to 67%! Your brain doesn't want to believe it, but the math is wild.",
        "funFact": "When Marilyn vos Savant published this solution in Parade Magazine back in 1990, she got absolutely roasted. Over 10,000 people wrote in saying she was wrong—including 1,000 PhDs! Even famous mathematicians were convinced she'd messed up. Turns out, she was right all along.",
        "wikiLink": "https://en.wikipedia.org/wiki/Monty_Hall_problem",
        "videoLink": "https://www.youtube.com/watch?v=TVq2ivVpZgQ",
        "videoTitle": "Watch Vsauce explain it",
        "artSrc": "/static/assets/paradoxes/monty-hall-art.png",
        "polaroidCaption": "Which door will you choose?"
    },
    {
        "id": "birthday",
        "title": "The Birthday Paradox",
        "date": "Probability Theory",
        "description": "Get 23 random people in a room, and there's already a 50% chance two of them share the same birthday. Sounds impossible, right? With just 70 people, it jumps to 99.9%! Here's why your brain gets tricked: you're thinking about the odds someone shares YOUR birthday. But the real question is whether ANY two people match. That completely changes the game. It's not about you—it's about all the possible pairs in the room.",
        "funFact": "This isn't just a party trick—cryptographers use this paradox to break security systems! It's called a 'birthday attack' and it's been used to forge digital signatures and crack hash functions. What seems like a harmless probability puzzle is actually a serious threat in computer science. Math isn't just abstract—it's powerful.",
        "wikiLink": "https://en.wikipedia.org/wiki/Birthday_problem",
        "videoLink": "https://www.youtube.com/watch?v=ofTb57aZHZs",
        "videoTitle": "Watch Vsauce2 explain it",
        "artSrc": "/static/assets/paradoxes/birthday-art.png",
        "polaroidCaption": "23 people equals 50% match"
    },
    {
        "id": "braess",
        "title": "Braess's Paradox",
        "date": "Network Theory",
        "description": "Imagine a city struggling with horrible traffic jams. City planners decide to build a brand new road to help ease congestion. Sounds great, right? Except... traffic gets WORSE for everyone. Way worse. This actually happens in real life! When you add more capacity to a network, people make selfish routing choices that end up clogging everything. Sometimes the solution to traffic isn't building more roads—it's actually closing them. Your shortcut becomes everyone's nightmare.",
        "funFact": "In 1990, New York City closed 42nd Street for Earth Day. Everyone expected chaos. Instead, traffic actually flowed better across the entire city! Then in 2003, Seoul removed a whole 6-lane highway and rebuilt a stream in its place. Traffic improved. Cities around the world have learned that sometimes, less really is more.",
        "wikiLink": "https://en.wikipedia.org/wiki/Braess%27s_paradox",
        "videoLink": "https://www.youtube.com/watch?v=cALezV_Fwi0",
        "videoTitle": "Watch Up and Atom explain it",
        "artSrc": "/static/assets/paradoxes/braess-art.png",
        "polaroidCaption": "More roads, more problems"
    },
    {
        "id": "simpson",
        "title": "Simpson's Paradox",
        "date": "Statistical Paradox",
        "description": "A drug works better than another treatment in every single hospital you test. Better results across the board. But then you combine all the data from all the hospitals, and suddenly it looks WORSE. The trend completely reverses! This happens when hidden variables are lurking in your data. The same set of numbers can tell you opposite stories depending on how you slice them. It's a reminder that statistics can be manipulated—or just misunderstood—to show whatever truth you're looking for.",
        "funFact": "UC Berkeley got sued for gender discrimination back in 1973. The numbers seemed damning—men had way higher admission rates overall. But when they broke it down by department, women actually had equal or BETTER acceptance rates. So what happened? Women were applying to more competitive departments. The paradox revealed that the discrimination wasn't in admissions—it was in where applicants felt they could succeed.",
        "wikiLink": "https://en.wikipedia.org/wiki/Simpson%27s_paradox",
        "videoLink": "https://www.youtube.com/watch?v=sxYrzzy3cq8",
        "videoTitle": "Watch TED Ed explain it",
        "artSrc": "/static/assets/paradoxes/simpson-art.png",
        "polaroidCaption": "Data can lie both ways"
    },
    {
        "id": "prisoner",
        "title": "The Prisoner's Dilemma",
        "date": "Game Theory Classic",
        "description": "Two criminals get arrested. The cops split them up and offer each the same deal: betray your partner and you walk free while they rot in jail for 10 years. If you both stay silent, you each get just 1 year. If you both betray each other, you each get 5 years. The 'rational' choice is to betray. But here's the problem: if you both think rationally, you both end up worse off. Cooperation beats cold logic every time—but trust is the hardest part.",
        "funFact": "In 1980, political scientist Robert Axelrod ran a tournament to find the best strategy. Complex algorithms from game theorists worldwide competed. The winner? The simplest strategy imaginable: Tit-for-Tat. Start nice, then copy whatever your opponent did last. It's kind, forgiving, and retaliatory in perfect balance. Sometimes the best strategy is just being a decent person who doesn't let others walk all over them.",
        "wikiLink": "https://en.wikipedia.org/wiki/Prisoner%27s_dilemma",
        "videoLink": "https://www.youtube.com/watch?v=t9Lo2fgxWHw",
        "videoTitle": "Watch The Place explain it",
        "artSrc": "/static/assets/paradoxes/prisoner-art.png",
        "polaroidCaption": "Trust or betray?"
    }
]