[
    {
        "id": "monty-hall",
        "title": "The Monty Hall Problem",
        "date": "Classic Game Theory",
        "description": "You're on a game show. Three doors: one car, two goats. You pick door number 1. The host opens door number 3 and reveals a goat. Now he asks: Switch to door number 2, or stay with number 1? Most people think it doesn't matter. They're wrong. Switching DOUBLES your chances from 33% to 67%!",
        "funFact": "When this appeared in Parade Magazine in 1990, over 10,000 readers including 1,000 PhDs wrote in saying the answer was wrong. Even famous mathematicians initially disagreed with the solution!",
        "wikiLink": "https://en.wikipedia.org/wiki/Monty_Hall_problem",
        "videoLink": "https://www.youtube.com/watch?v=TVq2ivVpZgQ",
        "videoTitle": "Watch Vsauce explain it",
        "artSrc": "/static/assets/paradoxes/monty-hall-art.png",
        "polaroidCaption": "Which door will you choose?"
    },
    {
        "id": "birthday",
        "title": "The Birthday Paradox",
        "date": "Probability Theory",
        "description": "In a room of just 23 random people, there's a 50% chance that two of them share the same birthday. With 70 people, it jumps to 99.9%! Your brain tricks you because you think about YOUR birthday. But the math asks about ANY two people sharing. That changes everything.",
        "funFact": "Cryptographers used this paradox to break hash functions and forge digital signatures. Birthday attacks are a real security threat in computer science. Math is not just puzzles, it's power.",
        "wikiLink": "https://en.wikipedia.org/wiki/Birthday_problem",
        "videoLink": "https://www.youtube.com/watch?v=ofTb57aZHZs",
        "videoTitle": "Watch Vsauce2 explain it",
        "artSrc": "/static/assets/paradoxes/birthday-art.png",
        "polaroidCaption": "23 people equals 50% match"
    },
    {
        "id": "braess",
        "title": "Braess's Paradox",
        "date": "Network Theory",
        "description": "Imagine a city with terrible traffic. Engineers build a new road to help. Suddenly, traffic gets WORSE for everyone. How? When you add capacity to a network, selfish routing can make the system less efficient. Closing roads sometimes speeds up traffic. Your shortcut ruins everyone's commute.",
        "funFact": "In 1990, Earth Day closed 42nd Street in New York City. Traffic actually improved across Manhattan! Seoul, South Korea removed a 6-lane highway in 2003 and traffic got better. Sometimes less is more.",
        "wikiLink": "https://en.wikipedia.org/wiki/Braess%27s_paradox",
        "videoLink": "https://www.youtube.com/watch?v=cALezV_Fwi0",
        "videoTitle": "Watch Up and Atom explain it",
        "artSrc": "/static/assets/paradoxes/braess-art.png",
        "polaroidCaption": "More roads, more problems"
    },
    {
        "id": "simpson",
        "title": "Simpson's Paradox",
        "date": "Statistical Paradox",
        "description": "A treatment works better than another in every single hospital. But when you combine all the data, it suddenly looks worse. The trend reverses! This happens when lurking variables hide in your data. Statistics can show opposite conclusions from the same numbers. Truth depends on how you slice it.",
        "funFact": "Berkeley was sued for gender discrimination in 1973. Overall, men had higher admission rates. But when broken down by department, women had equal or better rates. The paradox? Women applied to more competitive departments.",
        "wikiLink": "https://en.wikipedia.org/wiki/Simpson%27s_paradox",
        "videoLink": "https://www.youtube.com/watch?v=sxYrzzy3cq8",
        "videoTitle": "Watch TED Ed explain it",
        "artSrc": "/static/assets/paradoxes/simpson-art.png",
        "polaroidCaption": "Data can lie both ways"
    },
    {
        "id": "parrondo",
        "title": "Parrondo's Paradox",
        "date": "Game Theory",
        "description": "You have two losing games. Play either one alone, and you'll lose money over time. But alternate between them randomly, and suddenly you're winning. Two negatives make a positive! It defies intuition. Losing strategies can combine into a winning strategy. Randomness creates profit from loss.",
        "funFact": "This paradox has applications in genetics (evolution can proceed where neither mutation alone helps), financial markets, and even explains how biological systems use thermal noise to their advantage. Nature uses losing games to win!",
        "wikiLink": "https://en.wikipedia.org/wiki/Parrondo%27s_paradox",
        "videoLink": "https://www.youtube.com/watch?v=PpvboBJEozM",
        "videoTitle": "Watch Vsauce2 explain it",
        "artSrc": "/static/assets/paradoxes/parrondo-art.png",
        "polaroidCaption": "Lose + Lose = Win?"
    },
    {
        "id": "prisoner",
        "title": "The Prisoner's Dilemma",
        "date": "Game Theory Classic",
        "description": "Two criminals are arrested. Separately, they're offered a deal: betray your partner and go free while they serve 10 years. If both stay silent, both get 1 year. If both betray, both get 5 years. The rational choice is to betray. But if both think rationally, both suffer. Cooperation beats logic, but trust is hard.",
        "funFact": "Axelrod's tournament in 1980 proved the simplest strategy wins: Tit-for-Tat. Start by cooperating, then copy your opponent's last move. Kindness, forgiveness, and retaliation in perfect balance. It beat complex strategies from game theorists worldwide!",
        "wikiLink": "https://en.wikipedia.org/wiki/Prisoner%27s_dilemma",
        "videoLink": "https://www.youtube.com/watch?v=mScpHTIi-kM",
        "videoTitle": "Watch Veritasium explain it",
        "artSrc": "/static/assets/paradoxes/prisoner-art.png",
        "polaroidCaption": "Trust or betray?"
    }
]